org/interview.org
#+setupfile:./hugo_setup.org
#+hugo_slug: interview
#+TITLE: Interview

Advice and content for programming interviews and interview prep.

* Resources
- [[https://github.com/yangshun/front-end-interview-handbook][Front-end Interview Handbook]] :: Great resources for front-end developer interview questions.

- [[https://seanprashad.com/leetcode-patterns/][Leetcode Patterns]] :: The most common Leetcode questions with links to the corresponding problems. Useful for interview studying and preparation.
