content/posts/interview.md
+++
title = "Interview"
author = ["Jacob Chvatal"]
lastmod = 2020-09-27T21:17:40+02:00
slug = "interview"
draft = false
+++

Advice and content for programming interviews and interview prep.


## Resources {#resources}

[Front-end Interview Handbook](https://github.com/yangshun/front-end-interview-handbook)
: Great resources for front-end developer interview questions.


[Leetcode Patterns](https://seanprashad.com/leetcode-patterns/)
: The most common Leetcode questions with links to the corresponding problems. Useful for interview studying and preparation.
